import pandas as pd
columns = ['ФИО', 'Адрес', 'Телефон', 'Дата рождения'] # создаем таблицу с нужными колонками
kniga = pd.DataFrame(columns=columns)  # это наша адресная книга, пока пустая
while True:  # запускаем бесконечный цикл чтобы программа не закрывалась
    print("1 - Изменить запись")  # показываем пользователю какие команды есть
    print("2 - Удалить запись")
    print("3 - Добавить запись")
    print("0 - Выход")
    vibor = input("Выберите действие: ")  # ждем пока чел введет цифру
    if vibor == "1":
        name = input("Введите ФИО человека: ")  # спрашиваем у кого менять фио
        if name in kniga['ФИО'].values:  # проверяем есть ли вообще такой человек в таблице
            print("Поля: ФИО, Адрес, Телефон, Дата рождения")
            pole = input("Какое поле менять: ")  # спрашиваем какое поле менять
            if pole in columns:  # проверяем что такое поле вообще есть
                novoe = input("Введите новое значение: ")  # спрашиваем новое значение
                kniga.loc[kniga['ФИО'] == name, pole] = novoe  # меняем значение в нужной ячейке
                print("Запись для", name, "изменена")
            else:
                print("Нет такого поля")  # если поля нет, то пишем об этом
        else:
            print("Человек не найден")  # если такого человека нет говорим что не нашли его
    elif vibor == "2":
        name = input("Введите ФИО для удаления: ")  # спрашиваем кого удалить
        if name in kniga['ФИО'].values:  # проверяем есть ли такой человек
            kniga = kniga[kniga['ФИО'] != name].reset_index(drop=True)  # оставляем всех кроме него
            print("Запись", name, "удалена")
        else:
            print("Человек не найден")  # если нет такого  говорим что не нашли
    elif vibor == "3":
        fio = input("ФИО: ")  # спрашиваем данные для новой записи
        addr = input("Адрес: ")
        phone = input("Телефон: ")
        bday = input("Дата рождения: ")
        row = pd.DataFrame([[fio, addr, phone, bday]], columns=columns)  # делаем из них строку таблицы
        kniga = pd.concat([kniga, row], ignore_index=True)  # приклеиваем строку к книге
        print("Запись", fio, "добавлена")
    elif vibor == "0": # если чел выбрал 0 прекращаем прогу
        break
    else:  # если пользователь ввел не то что надо то выдаёт ошибку
        print("Неверный выбор. Попробуйте снова.")  
