import numpy as np
n = int(input("Введите количество строк (N): "))  # вводим N
m = int(input("Введите количество столбцов (M): "))  # вводим M
matrica = np.random.randint(1, 10, size=(n, m))  # создаем матрицу из случайных чисел от 1 до 9
print("\nИсходная матрица:")
print(matrica)  # выводим исходную матрицу
matrica_T = matrica.T  # транспонируем матрицу 
print("\nТранспонированная матрица:")
print(matrica_T)  # выводим транспонированную
if n == m:  # определитель можно найти только у квадратной матрицы
    opred_1 = np.linalg.det(matrica)  # определитель исходной
    opred_2 = np.linalg.det(matrica_T)  # определитель транспонированной
    print("\nОпределитель исходной матрицы:", opred_1)  # выводим 
    print("Определитель транспонированной:", opred_2)
    if opred_1 == opred_2:  # сравнение
        print("\nОпределители равны")
    else:
        print("\nОпределители равны но, из-за архитектуры и алгоритма Numpy прога считает их немного неправильно и говорит что они не равны")
else:
    print("\nОпределитель можно найти только у квадратной матрицы (N == M)")
